In [14]:
import pandas as pd
orders = pd.read_csv('data/orders.csv')

orders

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [15]:
group_order = orders.groupby('user_id').apply(lambda x: list(x['order_id'])).reset_index().rename(columns={0: "order_list"})

group_order

        user_id                                         order_list
0             1  [2539329, 2398795, 473747, 2254736, 431534, 33...
1             2  [2168274, 1501582, 1901567, 738281, 1673511, 1...
2             3  [1374495, 444309, 3002854, 2037211, 2710558, 1...
3             4  [3343014, 2030307, 691089, 94891, 2557754, 329...
4             5       [2717275, 1909121, 2267326, 157374, 2196797]
...         ...                                                ...
206204   206205                 [969311, 2658896, 414137, 1716008]
206205   206206  [3189322, 3351137, 540764, 2975608, 2028659, 5...
206206   206207  [2166133, 1074448, 1666077, 2364140, 2277235, ...
206207   206208  [2227043, 1959749, 3392839, 731227, 2936891, 2...
206208   206209  [3154581, 1889163, 1542354, 688306, 2307371, 3...

[206209 rows x 2 columns]

In [16]:
prior_order = pd.read_csv('data/order_products__prior.csv')

prior_order

          order_id  product_id  add_to_cart_order  reordered
0                2       33120                  1          1
1                2       28985                  2          1
2                2        9327                  3          0
3                2       45918                  4          1
4                2       30035                  5          0
...            ...         ...                ...        ...
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

[32434489 rows x 4 columns]

In [17]:
group_prior_order_id = prior_order.groupby('order_id').apply(lambda x: list(x['product_id'])).reset_index().rename(columns={0: "product_list"})

group_prior_order_id

         order_id                                       product_list
0               2  [33120, 28985, 9327, 45918, 30035, 17794, 4014...
1               3  [33754, 24838, 17704, 21903, 17668, 46667, 174...
2               4  [46842, 26434, 39758, 27761, 10054, 21351, 225...
3               5  [13176, 15005, 47329, 27966, 23909, 48370, 132...
4               6                              [40462, 15873, 41897]
...           ...                                                ...
3214869   3421079                                            [30136]
3214870   3421080  [27845, 4932, 18811, 41950, 31717, 12935, 2512...
3214871   3421081   [38185, 12218, 32299, 3060, 20539, 35221, 12861]
3214872   3421082  [17279, 12738, 16797, 43352, 32700, 12023, 47941]
3214873   3421083  [7854, 45309, 21162, 18176, 35211, 39678, 1135...

[3214874 rows x 2 columns]

In [19]:
train_order = pd.read_csv('data/order_products__train.csv')

train_order

         order_id  product_id  add_to_cart_order  reordered
0               1       49302                  1          1
1               1       11109                  2          1
2               1       10246                  3          0
3               1       49683                  4          0
4               1       43633                  5          1
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[1384617 rows x 4 columns]

In [21]:
group_train_order_id = train_order.groupby('order_id').apply(lambda x: list(x['product_id'])).reset_index().rename(columns={0: "product_list"})

group_train_order_id

        order_id                                       product_list
0              1  [49302, 11109, 10246, 49683, 43633, 13176, 472...
1             36  [39612, 19660, 49235, 43086, 46620, 34497, 486...
2             38  [11913, 18159, 4461, 21616, 23622, 32433, 2884...
3             96  [20574, 30391, 40706, 25610, 27966, 24489, 39275]
4             98  [8859, 19731, 43654, 13176, 4357, 37664, 34065...
...          ...                                                ...
131204   3421049         [40800, 17706, 33424, 17299, 26800, 34243]
131205   3421056                  [5750, 9340, 21709, 16475, 12432]
131206   3421058  [15629, 4347, 34466, 6244, 6858, 30316, 35578,...
131207   3421063                       [49235, 13565, 14233, 35548]
131208   3421070                               [35951, 16953, 4724]

[131209 rows x 2 columns]